#-*-coding:utf-8-*-
#========================================================================
#陈列选项
def iflx(dict):
	for i, item in enumerate(dict):
		print "%s: %s" % (item, dict[item])
#========================================================================
#========================================================================
#提出问题
def wfti(word):
	print word
#========================================================================
#========================================================================
#确认问题
def qtrf(dict):
	conf = "N"
	while conf != "Y" and conf != "y":
		print ""
		print '请输入相应的数字做出选择:'
		print '=' * 79
		try:
			choice = int(raw_input("> "))
			if choice in dict:
				print "你确认要选择：%s? Y/N" % dict[choice]
				conf = raw_input("> ")
			else:
				print "别闹~好好选~"
		except ValueError:
			print "别闹~好好选~"
	print "你的选择是 %d : %s" % (choice, dict[choice])
	print "=" * 79
	return dict[choice]
#========================================================================
#========================================================================
#全套
def qrtk(dict, word):
	wfti(word)
	iflx(dict)
	choice = qtrf(dict)
	return choice
#========================================================================
#========================================================================